{
  "posts": [
    {
      "author_name": "Rafael Zoehler",
      "title": "When I’m Gone",
      "description": "Death is always a surprise. No one expects it. Not even terminal patients think they are going to die in a day or two. In a week, maybe. But only when this particular week is the next week.",
      "post": "Death is always a surprise. No one expects it. Not even terminal patients think they are going to die in a day or two. In a week, maybe. But only when this particular week is the next week.\n\nWe are never ready. It is never the right time. By the time it comes, you will not have done all the things that we wanted to. The end always comes as a surprise, and it’s a tearful moment for widows and a bore for the children who don’t really understand what a funeral is (thank God).\n\nIt was no different with my father. In fact, his death was even more unexpected. He was gone at age 27. The same age that claimed the lives of several famous musicians. He was young. Way too young. My father was not a musician and neither a famous person. Cancer doesn’t pick its victims. He was gone when I was young, and I learned what a funeral was because of him. I was 8 and half, old enough to miss him for a lifetime. Had he died before, I wouldn’t have memories. I would feel no pain. But I wouldn’t have a father in my life. And I had a father.\n\nI had a father who was both firm and fun. Someone who would tell a joke before grounding me. That way, I wouldn’t feel so bad. Someone who kissed me on the forehead before I went to sleep. A habit which I passed on to my children. Someone who forced me to support the same football team he supported, and who explained things better than my mother. Do you know what I mean? A father like that is someone to be missed.\n\nHe never told me he was going to die. Even when he was lying on a hospital bed with tubes all over him, he didn’t say a word. My father made plans for the next year even though he knew he wouldn’t be around in the next month. Next year, we would go fishing, we would travel, we would visit places we’ve never been. Next year would be an amazing year. We lived the same dream.\n\nI believe — actually I’m sure — he thought this should bring luck. He was a superstitious man. Thinking about the future was the way he found to keep hope alive. The bastard made me laugh until the very end. He knew about it. He didn’t tell me. He didn’t see me crying.\n\nAnd suddenly, the next year was over before it even started.\n\nMy mother picked me up at school and we went to the hospital. The doctor told the news with all the sensitivity that doctors lose over the years. My mother cried. She did have a tiny bit of hope. As I said before, everyone does. I felt the blow. What does it mean? Wasn’t it just a regular disease, the kind of disease doctors heal with a shot? I hated you, dad. I felt betrayed. I screamed with anger in the hospital, until I realized my father was not around to ground me. I cried.\n\nThen, my father was once again a father to me. With a shoebox under her arm, a nurse came by to comfort me. The box was full of sealed envelopes, with sentences where the address should be. I couldn’t understand exactly what was going on. The nurse then handed me a letter. The only letter that was out of the box.\n\n“Your dad asked me to give you this letter. He spent the whole week writing these, and he wants you read it. Be strong.” the nurse said, holding me.\n\nThe envelope read WHEN I’M GONE. I opened it.\n\nSon,\n\nIf you’re reading this, I’m dead. I’m sorry. I knew I was going to die.\n\nI didn’t want to tell you what was going to happen, I didn’t want to see you crying. Well, it looks like I’ve made it. I think that a man who’s about to die has the right to act a little bit selfish.\n\nWell, as you can see, I still have a lot to teach you. After all, you don’t know crap about anything. So I wrote these letters for you. You must not open them before the right moment, OK? This is our deal.\n\nI love you. Take care of your mom. You’re the man of the house now.\n\nLove, dad.\n\nPS: I didn’t write letters to your mom. She’s got my car.\n\nHe made me stop crying with his bad handwriting. Printing was not easy back then. His ugly writing, which I barely understood, made me feel calm. It made me smile. That’s how my father did things. Like the joke before the grounding.\n\nThat box became the most important thing in the world for me. I told my mother not to open it. Those letters were mine and no one else could read them. I knew all the life moments written on the envelopes by heart. But it took a while for these moments to happen. And I forgot about it.\n\nSeven years later, after we moved to a new place, I had no idea where I put the box. I couldn’t remember it. And when we don’t remember something, we usually don’t care about it. If something goes lost in your memory, It doesn’t mean you lost it. It simply doesn’t exist anymore. It’s like change in the pockets of your trousers.\n\nAnd so it happened. My teenage years and my mother’s new boyfriend triggered what my father had anticipated a long time before. My mother had several boyfriends, and I always understood it. She never married again. I don’t know why, but I like to believe that my father had been the love of her life. This boyfriend, however, was worthless. I thought she was humiliating herself by dating him. He had no respect for her. She deserved something a lot better than a guy she met at a bar.\n\nI still remember the slap she gave me after I pronounced the word “bar”. I’ll admit that I deserved it. I learned that over the years. At the time, when my skin was still burning from the slap, I remembered the box and the letters. I remembered a specific letter, which read “WHEN YOU HAVE THE WORST FIGHT EVER WITH YOUR MOM”.\n\nI ransacked my bedroom looking for it, which earned me another slap in the face. I found the box inside a suitcase lying on top of the wardrobe. The limbo. I looked through the letters, and realized that I had forgotten to open WHEN YOU HAVE YOUR FIRST KISS. I hated myself for doing that, and I decided that would be the next letter I’d open. WHEN YOU LOSE YOUR VIRGINITY came right next in the pack, a letter I was hoping to open really soon. Eventually I found what I was looking for.\n\nNow apologize to her.\n\nI don’t know why you’re fighting and I don’t know who’s right. But I know your mother. So a humble apology is the best way to get over this. I’m talking about a down-on-your-knees apology.\n\nShe’s your mother, kid. She loves you more than anything in this world. Do you know that she went through natural birth because someone told her that it would be the best for you? Have you ever seen a woman giving birth? Do you need a bigger proof of love than that?\n\nApologize. She’ll forgive you.\n\nLove, dad.\n\nMy father was not a great writer, he was just a bank clerk. But his words had a great impact on me. They were words that carried more wisdom than all of my 15 years of age at the time. (That wasn’t very hard to achieve, though).\n\nI rushed to my mother’s room and opened the door. I was crying when she turned her head to look me in the eyes. She was also crying. I don’t remember what she yelled at me. Probably something like “What do you want?” What I do remember is that I walked towards her holding the letter my father wrote. I held her in my arms, while my hands crumpled the old paper. She hugged me, and we both stood in silence.\n\nMy father’s letter made her laugh a few minutes later. We made peace and talked a little about him. She told me about some of his most eccentric habits, such as eating salami with strawberries. Somehow, I felt he was sitting right next to us. Me, my mother and a piece of my father, a piece he left for us, on a piece of paper. It felt good.\n\nIt didn’t take long before I read WHEN YOU LOSE YOUR VIRGINITY\n\nCongratulations, son.\n\nDon’t worry, it gets better with time. It always sucks the first time. Mine happened with an ugly woman…who was also a prostitute.\n\nMy biggest fear is that you’d ask your mother what virginity is after reading what’s on the letter. Or even worse, reading what I just wrote without knowing what jerking off is (you know what it is, right?). But that’s none of my business.\n\nLove, dad.\n\nMy father followed me through my entire life. He was with me, even though he was not near me. His words did what no one else could: they gave me strength to overcome countless challenging moments in my life. He would always find a way to put a smile on my face when things looked grim, or clear my mind during those angry moments.\n\nWHEN YOU GET MARRIED made me feel very emotional. But not so much as WHEN YOU BECOME A FATHER.\n\nNow you’ll understand what real love is, son. You’ll realize how much you love her, but real love is something you’ll feel for this little thing over there. I don’t know if it’s a boy or a girl. I’m just a corpse, I’m not a fortune teller.\n\nHave fun. It’s a great thing. Time is gonna fly now, so make sure you’ll be around. Never miss a moment, they never come back. Change diapers, bathe the baby, be a role model to this child. I think you have what it takes to be an amazing father, just like me.\n\nThe most painful letter I read in my entire life was also the shortest letter my father wrote. While he wrote those four words, I believe he suffered just as much as I did living through that moment. It took a while, but eventually I had to open WHEN YOUR MOTHER IS GONE.\n\nShe is mine now.\n\nA joke. A sad clown hiding his sadness with a smile on his makeup. It was the only letter that didn’t make me smile, but I could see the reason.\n\nI always kept the deal I had made with my father. I never read letters before their time. With the exception of WHEN YOU REALIZE YOU’RE GAY. Since I never thought I’d have to open this one, I decided to read it. It was one of the funniest letters, by the way.\n\nWhat can I say? I’m glad I’m dead.\n\nNow, all joking aside, being half-dead made me realize that we care too much about things that don’t matter much. Do you think that changes anything, son?\n\nDon’t be silly. Be happy.\n\nI would always wait for the next moment, the next letter. The next lesson my father would teach me. It’s amazing what a 27 year old man can teach to an 85 year old senior like me.\n\nNow that I am lying on a hospital bed, with tubes in my nose and my throat thanks to this damn cancer, I run my fingers on the faded paper of the only letter I didn’t open. The sentence WHEN YOUR TIME COMES is barely visible on the envelope.\n\nI don’t want to open it. I’m scared. I don’t want to believe that my time is near. It’s a matter of hope, you know? No one believes they’re gonna die.\n\nI take a deep breath, opening the envelope.\n\nHello, son. I hope you’re an old man now.\n\nYou know, this letter was the easiest to write, and the first I wrote. It was the letter that set me free from the pain of losing you. I think your mind becomes clearer when you’re this close to the end. It’s easier to talk about it.\n\nIn my last days here I thought about the life I had. I had a brief life, but a very happy one. I was your father and the husband of your mother. What else could I ask for? It gave me peace of mind. Now you do the same.\n\nMy advice for you: you don’t have to be afraid\n\nPS: I miss you",
      "time": "2018/6/23",
      "id": 1
    },
    {
      "author_name": "Jordan Brown",
      "title": "What I’ve Learned from Being “Way Too Intense”",
      "description": "For most of my life, there was one trait of mine that I struggled to accept.\n\nIt felt like a part of myself that I should hide from others.",
      "post": "It made me feel “weird” and unlovable.\n\nAnd to give you some background, I was already weird enough.\n\nFor example, I remember, starting when I was seven or eight, giving speeches to myself in my room.\n\nIt would be about anything.\n\nIt might be to prepare for an upcoming conversation I was going to have.\n\nOr, perhaps, it was a rehashing of the day’s events — announcing to the air the witty comments I should have made to my friends and foes.\n\nTo clarify, I never did this in public. I only said this in my room. I knew it was weird after all, and I didn’t want to let people in on this little secret.\n\nBut that’s not the trait I’m talking about here.\n\nThe character trait i’m talking about is my “intensity.”\n\nI was an intense kid,I grew up to be an intense teenager, and now I’m an intense adult.\n\nWhen I was a kid, I shunned it, and I did the same as I got older.\n\nI didn’t want to be seen. as the guy who took things too far, who didn’t know how to take a joke, and who pursued his interests a little too eagerly.\n\nIt started off innocuously enough — or so I assume that’s how it appeared to the outside world, to people like my parents and my sister, my teachers and my friends.\n\nFor instance, I started off small and worked on jigsaw puzzles like a madman. I sometimes had multiple going at the same time.\n\nOr, when my family took summer vacations, I brought along five or six different books, usually The Boxcar Children or Goosebumps.\n\nAnd then I proceeded to read them all at the same time.\n\nI would read chapter one in the first book, then place it face-down on the seat next to me save my spot before moving on to chapter one of the second book. I would repeat this process until I completed the cycle — and then would pick up where I left off with the first book.\n\nI think my parents found it kind of amusing that I had 6 books smashed, face-down, on the seat next to me. But now I realize how intense it all was.\n\nThe real question is:\n\nWhy did I do this?\nI’m still not totally sure.\n\nAs far as I can tell, there is a part of me that needs to be methodical in his actions. I love learning, and I don’t want to miss a thing — so I optimize it. I try to do it all.\n\nAs a kid, this seemed possible.\n\nAs an adult, it basically caused me to have multiple nervous breakdowns.\n\nNow that my brain has evolved (devolved?) and knows the terms to describe how I experience the world, I realize I live with a more-than-healthy amount of anxiety and obsessive-compulsive tendencies. I’m not one for labels, but these two terms aptly describe me in the majority of situations.\n\nYou wouldn’t notice it, though.\n\nPeople with anxiety and obsessive-compulsive tendencies are excellent at hiding their symptoms.\n\nStill, everyone has a breaking point, and I learned that the read — all — the — books — at — once method for living was not good for my mental health.\n\nWhen I got older, I developed this weird habit of trying to get through a book just so I could start another one. It got to a point where I wasn’t even enjoying what I was reading anymore.\n\nMaybe that behavior was a remnant of how I acted as a kid, when I was carefree and acting like that wouldn’t overload my brain.\n\nWhatever the reason, I know now that it’s too intense.\n\nAnd not just objectively, “this is pretty weird” intense. It subjectively felt too intense for me as well.\n\nBut intensity is not all bad. Being this way has gotten me pretty far in life. It’s all about tempering it, about how I use the intensity.\nDeveloping a meditation habit has helped a lot in this regard.\n\nIt has taken me out of my head and placed my into the squishy, knobby thing that is my body.\n\nWith deep breathing, and with monitoring and letting go of my thoughts, I have learned to check in with myself when I feel a rush of intensity coming on.\n\nHere’s a story to illustrate my point.\n\nRecently, I decided I had had enough with the QWERTY keyboard.\nIf you’re reading this right now on a piece of technology — which you assuredly are — I assume you’re familiar with the standard keyboard layout. If you’re near a keyboard, look at the keys in the upper-left corner. They’re under the numbers. Yeah, you got it! Look at you accomplishing tasks!\n\nWell, I recently read an article about Matt Mullenweg, one of the creators of WordPress — you know, the software that powers a ridiculous number of the world’s websites — and he was talking about knowing that he would probably be typing for the majority of his life, so he might as well learn a more efficient keyboard layout. He decided to learn DVORAK, a keyboard layout in which the most common letters used are all laid out in close proximity to the “home row,” thus making typing more efficient and easier on the fingers.\n\nI read that article a few weeks ago, and immediately thought, sold. I’m doing that.\n\nNow, this wasn’t the first time that I had heard about the DVORAK keyboard layout or even the first time I considered learning it, but to hear Mullenweg explain his rationale so matter-of-factly convinced me right then and there.\n\nIt just “clicked” in my intense brain.\n\nThere wasn’t any long deliberation, which used to happen a lot with my overanxious mind. I just decided to do it.\n\nTo plan for this, I didn’t map anything out. I just searched the Internet until I found some free typing-training programs that could teach me how to type using the DVORAK layout. (By the way, if you have any interest in doing what I’m doing, Typing Club is free and amazing.)\n\nAfter five hours of practice — Typing Club tracks everything for me — I have now memorized the entire alphabet and am up to over 25 words per minute.\n\nConsidering the fact that I am working against a lifetime of muscle memory, that’s not too shabby.\n\nThis is what I’m talking about, though. I get an idea in my mind, my intensity kicks in, and I become obsessed with the idea.\n\nNow, the old me would probably spend all of my waking time learning this interesting, allegedly more efficient typing method.\n\nThe current me — the me that is kind of like the old me, but wiser and with a receding hairline — that me is much more sensible.\n\nUsing the enhanced awareness that I have thanks to my meditation magic, I check in with myself now.\n\nI ask questions like:\n\nIs this a good use of my time?\nAm I enjoying this?\nBut really, will this REALLY help me down the road? How?\nIs my back starting to throb?\nI check in with myself repeatedly while I am doing the bizarre, intense, self-inflicted rewiring of my brain that is DVORAK typing.\n\nAnd I realize that I’m actually really enjoying it.\n\nSure, it’s incredibly tough fighting off decades of muscle memory, but it’s a really fun challenge — and I get immediate feedback in the form of improved typing speed and accuracy.\n\nAt the very least I’m keeping my brain active, working it in a way that it wouldn’t normally be worked.\n\nAnd telling you this story now reminds me that what I’m doing now, teaching myself typing, is precisely the way that I learned how to type in the first place.\nWhen I was a kid in fifth grade, my family from one town in upstate New York to another town about 45 minutes away.\n\nOther than being ripped from my one familiar environment and the only friends and sports teammates that I ever knew, this wouldn’t be too big of a deal. (I know my parents will probably read this, so I made it extra dramatic just to increase their blood pressure a little bit.)\n\nExcept, it WAS A BIG DEAL.\n\nIt just so happened that my original school had not yet taught typing when I left it. Then, when I got to my new school, the kids had already learned how to type correctly! That means they learned how to type using all of their fingers — not just two or three.\n\nThis was not good.\n\nNot only was I the new kid, I was also one of the only kids pecking at his keyboard like a frightened pigeon. (Again, mom and dad, this all your fault.)\n\nBut then my intense, overactive brain kicked in, and I used my own money to buy Mavis Beacon Teaches Typing.\n\nWhy, on Earth, did I do this?\nWhat kid in his right mind would use his own allowance to buy Mavis Beacon Teaches Typing?\nThis guy right here.\n\nAnd I guess you could say the fear of being different, an unlovable social outcast, was a powerful motivator. I already felt different enough when I was growing up, so I definitely did not want to be identified only by the sound of my slow, lonely pecks at the keyboard. How would I ever get to play the Oregon Trail like the other kids if I was always the last one to finish typing?\n\nMavis Beacon saved my life.",
      "time": "2018/6/23",
      "id": 2
    },
    {
      "author_name": "Kay Bolden",
      "title": "Never",
      "description": "A Short Story",
      "post": "“You look beat,” I said, giving him a once over. The diner’s dim light cast a hazy glow on his clenched jaw. “Maybe we should do this tomor — ”\n\n“No,” he cut me off, his voice low and deep.\n\n“Have you been sleeping?” I pressed. He’d always been a fitful sleeper, but there were a few routines that helped. “You know you need to — ”\n\n“I need to sleep with you,” he said, his brows crashing together. “Come home with me.”\n\nI forced out a weak laugh. “Just like that? I don’t think so.”\n\nI watched his eyes, heavy-lidded, as he stared down at me. “I don’t think I’ve slept a whole night since the night you left me.”\n\nI broke the gaze — I had to — and claimed our favorite booth in the corner. He slid in right beside me like always, crowding me, making me inhale him, citrus and whiskey and warm male skin.\n\n“I thought you would have just …” I trailed off because I’d started speaking without thinking.\n\nHe let out a deep breath as I leaned back. “Thought I would’ve? What?”\n\nI shook my head. He looked really good, and I’d told him so back at the bar, hours ago. He’d always had those broad shoulders, that loose-hipped stride, but he was harder now. Leaner. More defined.\n\n“Tell me.”\n\nI shrugged. “Would’ve gone back to your regular life. Gotten married. Bought a house. Had a kid. Things people do.”\n\nHe snorted. “I liked my life just fine the way it was.” The waitress wandered over and he ordered apple pie and cheesecake, because after midnight, you have pie. It was a rule.\n\n“You didn’t though,” I said when he was done. “You didn’t like my crazy hours, and half-naked musicians sleeping on the couch, and the phone ringing constantly.” You like Netflix, and clean underwear, and steady paychecks. And I never knew how to do that, to want that. To be that girl.\n\n“You still don’t know shit about what I need.”\n\nThe pie arrived with strawberry swirls on the cheesecake, caramel ice cream on the apple pie, and a whole pot of coffee because we’d both kill for it.\n\nThe pie crust melted in my mouth and lent me its courage. “We were fighting all the time. You hated it.”\n\nHe dropped his fork with a clatter and grabbed my wrist.\n\n“No. You hated it. You hate arguing,” he said sharply. “You know what I hate? Cowards. People who run.”\n\nHe stood up abruptly and walked away. To find a wall to punch or a crate to kick. To run his hands through his long hair until it spiked in all directions. And then come back to me, rolling his shoulders, half smiling, as if —\n\n“So. Enough of that. Tell me about the boyfriend.” He scooted back in, knuckles turning pink, hair flying.\n\n“Ex-boyfriend.” The words were feather light, and now, so was I.\n\n“Was he good in bed?”\n\nI rolled my eyes. “Not going there with you.”\n\n“Was he?” He seemed more amused than jealous and that irked me.\n\n“Yes, he was amazing,” I snapped.\n\nHis grin was instant and evil. “Liar.”\n\n“You don’t know anything about me anymore.”\n\n“The hell I don’t.”\n\n“Rick was — ”\n\n“Lousy in bed,” he chuckled, pressing his thigh to mine as he leaned against me. “I bet he was all sweet and gentle and asking permission. Oh baby can I touch you here? Can I lick you there? And — ”\n\n“I liked it when you were gentle,” I corrected him.\n\nHe stroked the back of his fingers up the side of my neck to just behind my ear, and I shivered. His warm breath stirred up a puff of sleepy memories. “You like it gentle after,” he said, his voice gravelly. He bit my neck softly, then sucked hard.\n\nI fought to keep quiet.\n\n“All this time, you think I don’t know?” His tongue flicked out, lighting tiny flares along my nerves. His arm was an anchor, holding me tight, and my head dropped back without asking my permission.\n\nThen his mouth claimed mine and I remembered everything. The sheer size and weight of him, holding me down. The crackle of fire streaking through my veins. The utter fury of his desire, a force I never could control. Except by surrendering.\n\nI broke the kiss. I had to.\n\n“Missed that,” he panted, his forehead against mine.\n\nAnd what could I say? I’d been in Chicago barely 24 hours and I’d walked straight into his bar. Hoping I could see him one last time and finally let him go. Or close my eyes and finally make the leap. Hoping.\n\n“It’s too soon,” I said, and even to me, the words sounded empty.\n\nI put my hands on his massive chest and tried to push him back but he didn’t budge.\n\n“No?” His strong hands were so gentle on my face.\n\n“No,” I said. “I just wanted to catch up. Say hello.”\n\n“Liar.” He breathed against my lips, his hand under my chin, his thumb sliding over my bottom lip. “Kiss me again.”\n\nI don’t know why I woke up. Maybe because my hair was trapped between his bicep and the pillow. Or because the blinds were wide open and the sun was waking up, too, all red and streaky over the lake. Maybe I was time-traveling again, floating between then and now, my body just a blurry imprint on his soft, cotton sheets.\n\n“Should we — should we go to my hotel, instead of your place?” I’d asked him in the car.\n\n“No,” he said instantly. “Our bed.”\n\n“Just in case. You know.” I squirmed.\n\nHis eyes crinkled at the corners. “You think there’s some other woman’s stuff in our house?”\n\nNo reason to feel giddy at his tone. No reason at all. “I doubt you’ve been a monk for three years,” I scoffed.\n\nHe shrugged. “No. I haven’t.” He wheeled the big SUV into the driveway and turned to look directly at me. “But not in our bed.”\n\nSlowly, I tried to untangle my body parts. The noise he made when I pulled away from him was half-whimper, half-moan. It made me smile.\n\n“What?” he said gruffly, not opening his eyes.\n\n“Nothing.” I shook out my hair and moved back into his arms. I gave his hard chest a soft kiss, and he caught me close without thinking. Reflex. Muscles and synapses, remembering every sequence, in perpetuity.\n\n“Tell me.”\n\n“I just never thought I would end up here again,” I sighed.\n\n“That’s funny,” he whispered. “Because I never once doubted it for a second.”",
      "time": "2018/6/23",
      "id": 3
    },
    {
      "author_name": "Tim Rettig",
      "title": "26 Versions Of Myself That Are No Longer Me.",
      "description": "I am no longer the person on my profile image.",
      "post": "no longer the person on the image, you see. That person used to exist at a time, when I wanted to build a public speaking business. I thought for that business, it would be necessary to look fancy and wear a suit. Today, I just want to show my honest, true self. Not some ‘seemingly’ super successful version of myself, that doesn’t exist.\nI am no longer the person, who is aiming to be the world’s best writer on intercultural communication. That was my goal for seven years. But with my fathers death, that goal has faded away, too. Why? Because I realize, that it is constantly taking me away from family. And that’s no longer a sacrifice, I am willing to make.\nI am no longer the person who knows exactly, where he’s going. The moment I stopped following my goal on becoming the world’s best writer on intercultural communication, I also lost my sense of direction. I don’t know exactly what I want to do with my life. What is going to replace my previous passion and dreams. And that is okay.\nI am no longer that gaming addicted, shy teenager, who I used to be. Today, albeit introverted by nature, I can make friends wherever I go. After seven years of living in three different countries, I have learned how to build relationships and social connections quickly.\nI am no longer the person, who blindly follows his passion. I used to think that if only I followed my dreams and did what I believed in, then I eventually would be successful. Today, I know that this is not true. I can’t go on living far removed from any reliable sources of income for a long period of time.\nI am no longer the person, who jumps on any shiny opportunity coming up. I now understand, that ‘new opportunities’ are mostly just distractions in disguise. I no longer give in to any project, that arises my curiosity and distracts me from the things, that truly matter.\nI am no longer the lonely creator, who only cares about producing his best work possible. Today, I understand that community is just as important as the creative process. Instead of focusing on nothing but the creative process, I now focus on building and facilitating a community.\nI am no longer the person, who just one-dimensionally thinks about his work. At latest, the first time I collapsed, was a wake up call for me, that there is so much more to living than just work. Since then, a productive way of resting has become a so much more important part of my life, than I ever imagined..\nI am no longer that 19-year old who wants to change the world. At 19 I moved to Indonesia, working as a volunteer in a development aid project. I thought that by going into this field, I could make some real differences for people in ‘poor’ countries. As you can imagine, I quickly learned my lesson.\nI am no longer a person, who thinks that he is special. I no longer think that I am destined, to do great things. Now, I only focus on improving myself a little bit every single day. With a little bit of luck, I will make a tiny little impact on the people around me, in the process.\nI am no longer the person, who puts adventure above everything else. Recently, me and my partner decided to get a little kitten. My old self, would’ve never even considered this, despite the fact that I love animals. A kitten (pets in general), makes it so much harder to travel and live according to ones own plan. I am now happy to make a lot of sacrifices, in order to take responsibility for this lovely little cat.\nI am no longer that person, who is scared of selling. I always thought of selling as something that comes as a by-product, when you provide great value. Unfortunately, it’s not that easy. I am working every single day to let go off my fear to sell.\nI am no longer the person, who is addicted to books. Ever since my early university years, books have been my major addiction. Yes, books can be a bad thing. If you spend way too much money on them, and if you spend way too much time consuming them. Everything has to be done in moderation. Even reading. Luckily, I am more and more turning into a person who is consuming less and doing more.\nI am no longer the person, who sees himself as nothing but a creator. Today, I recognize the value of community much more. Whereas in the past, I would invest all of my energy into the creation process alone. Today, I see myself much more as a community leader. Somebody, who facilitates conversations, instead of just sharing ideas.\nI am no longer that loyal friend I once was. This is a development about myself, which I regret very much. Because of my shy self, I used to be the most loyal of friends (to those few people, who were my close friends). Today, because I travel so much, I have developed a bad habit. It’s somehow the ‘out of sight, out of mind’ habit. I suck at checking in with old friends who are now living at a completely different end at the world, simply to see how they’re doing. Here, I really need to return to who I once was.\nI am no longer that person, who loves the hustle and bustle of big metropolitan cities. Oh my god. How much I used to love metropolitan cities like Jakarta with its population of 10 million. I loved how busy they were and how much there was to do. Today, I just want to have my quiet and calm space. A space that allows me to concentrate, go for a walk, and simply enjoy nature.\nI am no longer the person, who is far removed from the reality of life. I used to be super idealistic. Wanting to live this lifestyle of my dreams, pursuing all these different goals. Today, I am much more grounded in reality, balancing between my own dreams and the reality on the ground.\nI am no longer the person, who is using a scattershot approach to his work and life. There was a time, where I was constantly thinking about all sorts of things to do, all sorts of projects to get involved in, all sorts of things to achieve. Today, I am pretty good at being 100% committed to the one single thing, that is important right now in terms of my career: growing the reach of my blog and my writing in general.\nI am no longer the person, who bites his nails out of stress. Oops. Big lie! Just like I have always been, I am an anxious and stress sensitive person. I still bite my nails, just like I’ve always done. I still get stomach pain out of stress on a regular basis.\nI am no longer the person without hobbies (outside of writing). Today, I am trying to live a lifestyle, in which I am creative in every aspect of my life. It still doesn’t work perfectly, but I certainly have brought some nice new hobbies into my life (e.g. playing the electronic keyboard).\nI am no longer the person, who trusts strangers blindly. After a terrifying experience with a seemingly super nice stranger, I have become super cautious about how far I let strangers into my life. I take things much more slowly.\nI am no longer the person, who is terrified about returning to Germany (now I’m just slightly scared, not terrified). If you had told me two years ago, that I would be returning to my home country to actually live there for a while, I’d have thought that you are crazy. After all, for the past seven years, I have done everything to build my life in a way, that it would continuously allow me to live abroad. How quickly things can change…\nI am no longer the extreme risk-taker, that I once was. Two years ago, I moved to a highly sanctioned country, thinking that I could establish a digital marketing agency for all those European businesses, which were supposed to flock into the market once the sanctions were lifted. I thought that I would be one of the few with the guts to actually take that step and make it happen. In hindsight, all I can say is that I am no longer the person, who would be willing to take huge business risks like these.\nI am no longer that guy, who is content with his skinny body. You see, I am quite skinny. I always have been. And I was always fine with that, despite it being bad for my health. It is really difficult for me to put on weight, regardless of what I eat. The only way to change that, would be through heavy exercise and building muscle. I don’t like going to the gym. But I will have to figure out my own way of doing so, soon.\nI am no longer living in the past, or the future. Today, I am trying to cut out all kinds of regret (past) and fear (future) out of my life. Neither of them add any value to how my life is developing. Of course, I can not always live up to that ideal. But I am trying my best to live in the present every single day. And that is what matters.\nI am no longer ‘just’ an aspiring author. I have finally taken the courage to put in an extended period of time and finish the first version of my book, which is something that has been long overdue. Honestly, I put it off for a long time. Probably because I was scared. Scared of not producing the best work possible. Scared of letting my blog die, while I was focusing my attention on the book. Scared of never finishing it.\n27. One little extra:\n\nI wish I was no longer the person, who is terrible at bringing balance into his life.\n\nFrom all the changes that should have happened in my life, but didn’t, this is probably the one, which is most important to me. For my whole life, I have been struggling with balance. Most of the time, my attention focuses on one thing and then obsesses with that, while disregarding everything else. This is definitely something about myself, that needs to change.\n\nSome final words:\nThis was a really helpful thought exercise for me to go through. Asking myself which aspects about me have died and how I have changed over the years, has given me a lot of insights about myself.\n\nI love doing exercises like these on a regular basis, because they are a great way of enhancing self-awareness and teaching me more about myself.\n\nOriginally, my goal of today has been to brainstorm 100 versions about myself, which have died. That didn’t quite work out. I was already struggling to come up with more, after 12 points.\n\nSo I told myself:\n\n“Alright, Tim. You won’t reach the 100 today. But at least, you can go for 26. That’s one for each year, that you are alive. There should have been at least one change about you every single year, that you were born!”\nSo, I asked myself questions like these:\n\nWhat aspects of my old self have died over the years and changed into something completely different?\nWhat were the most drastic changes in my life and in my personality ever since I left Germany?\nWho did I used to be and who am I right now?\nIf you are interested in becoming a little bit more conscious about yourself, then I recommend giving these exercises a try. I think that they will provide you with some really interesting insights, that you previously weren’t aware of.\n\nTim Rettig is the author of “Struggling Forward: Embrace the struggle. Achieve your dreams”. It’s a book about the psychological journey of struggle, which every (creative) entrepreneur must pass through, before they can turn their vision into reality.",
      "time": "2018/6/23",
      "id": 4
    },
    {
      "author_name": "We Share to Inspire",
      "title": "How to Break Free from Comparing Myself with Others",
      "description": "What really works and what doesn’t",
      "post": "On a daily basis I come across people who seem to be more beautiful, more intelligent, more successful, kinder or happier than me. There are endless reasons why I let myself compare with others that it can become an obstacle in my life when I make this a daily habit.{\"~\n\"}{\"~\n\"}With all the changes in society and the progress of science I should probably just start to accept that in this dynamic world, the only way to survive would probably be to never give up on investing in my personal development.{\"~\n\"}{\"~\n\"}I want a better job? I better start becoming a super-hero version of myself to stand out within the hundreds of potential candidates for the job.{\"~\n\"}{\"~\n\"}Or other people might be in a relationship and fearing that they will never be good enough. I realized that the only actual way to overcome this is to start doing the inner work of believing that in reality no human is better than the other.{\"~\n\"}{\"~\n\"}There are reasons why certain people might seem to excel in life as I wish for myself. We are differently raised in parental education, environment and the opportunities that have passed by, as well as the ones I’ve seized. The behaviour that comes along with that is the result and quality of the current state of my life.{\"~\n\"}{\"~\n\"}The good news is that personal growth is a free source available to anyone.{\"~\n\"}{\"~\n\"}And if there’s one reason why investing in personal growth should become my best friend, it is that it’s there to help overcoming the difficult phases. Taking the time to invest in my personal growth will free me from the walls of negative thinking. It will free me from everything that hurts my soul and growth.{\"~\n\"}{\"~\n\"}First, I would like to emphasize that a little bit of competition can be healthy. In fact, I even believe when I don’t allow this, my personal growth will stop and never reach its full potential. Because competition shows me what I can reach, not necessarily what I should. It simply demonstrates the results I can achieve when I never stop shooting for the stars.{\"~\n\"}{\"~\n\"}The other side, unfortunately is, that when I start comparing myself with others, it might take a negative turn. When I feel insecure about myself that I stop taking opportunities or avoid social situations, I believe it is important to research what could help to resolve this.{\"~\n\"}{\"~\n\"}For a very long time I’ve asked myself what could possibly help me stop comparing myself with others. I read dozen of articles on this, but so far none of them has provided me with satisfying answers. And there was no way other than experiencing the remedy itself.{\"~\n\"}{\"~\n\"}What doesn’t work{\"~\n\"}Let’s first start with the part that doesn’t work and I hope you can relate to this.{\"~\n\"}{\"~\n\"}I’ve read about stories of couples in a relationship, feeling like they can never be good enough for the other one. I’ve also seen this happening in my personal environment. Destructive feelings such as jealousy and suspicion might rise when people don’t get the confirmation they need.{\"~\n\"}{\"~\n\"}It can even become more disastrous when there has been unfaithfulness.{\"~\n\"}{\"~\n\"}I wondered myself what could nurture someone’s sadness when the person has gone through unfaithfulness?{\"~\n\"}{\"~\n\"}And what would I do or feel myself if one day someone would leave me for a person who might even not be more attractive.{\"~\n\"}{\"~\n\"}Regardless if “the other one” were more attractive, the reality then is ‘I will be left’ for someone else. And what happens after is wondering what the other person has that I don’t have. (This can also happen in non-romantic relationships, in friendships that end.){\"~\n\"}{\"~\n\"}The support of friends and family probably goes like this:{\"~\n\"}{\"~\n\"}“You’re beautiful.”{\"~\n\"}{\"~\n\"}“You’re more than good enough. It’s not your fault.”{\"~\n\"}{\"~\n\"}“Nah, don’t be so weird, it will get better, you’re a great person.”{\"~\n\"}{\"~\n\"}“He doesn’t deserve you. You have everything as a person.”{\"~\n\"}{\"~\n\"}The most common action is trying to see all the flaws in that other person. That doesn’t work for long.{\"~\n\"}{\"~\n\"}Finding someone else’s flaws is really difficult. In reality that other person might not be less beautiful (or better) than me. It would be just my insecurity at the moment trying to fool me that the other person is a weird one. But in reality, there will still be this nagging feeling of comparing myself with others.{\"~\n\"}{\"~\n\"}The difficulty of thinking “I might never be good enough” doesn’t go away with only a positive mindset. And although a positive mindset can start miracles and is a good first step, when action is missing out, no positive progress will be made.{\"~\n\"}{\"~\n\"}There are other affirmations as well, such as:{\"~\n\"}{\"~\n\"}- Learn to be more grateful{\"~\n\"}{\"~\n\"}- Accepting who I am{\"~\n\"}{\"~\n\"}- Stop looking at people’s profiles on social media{\"~\n\"}{\"~\n\"}These affirmations might help, but don’t always immediately fill the emptiness within that leads to this act.{\"~\n\"}{\"~\n\"}What does work{\"~\n\"}Finding the things in life I care about and that ‘one thing’ that people can wake me up for at 3 A.M. helped me to stop comparing myself with others.{\"~\n\"}{\"~\n\"}This part of life is even more important than I could have ever imagined. This is the only practical advice that actually does work, because when I start (literally) working on myself and finding the things in life I care about, my actions will be followed by results. These results will give me the satisfaction I initially didn’t have and led to the unnecessary action of comparing myself with others.{\"~\n\"}{\"~\n\"}When I discover my skills and qualities, there won’t be anyone who can shake my confidence. Why? Because of these exact results it will bring, giving joy and peace and helping create inner confidence that I’m good enough. That there is no need to compare myself with others. There really isn’t.{\"~\n\"}{\"~\n\"}There are some great myths surrounding this topic. When reading headlines such as:“Find your passion/calling/destiny” or “Find something you’re good at”, I initially thought that this applies only to the entrepreneurs in life. To the heroes who build their life through hustling, sweating blood and tears while making their life a success.{\"~\n\"}{\"~\n\"}But regardless of how small or big my influence is, these human topics are no exceptions for anyone.{\"~\n\"}{\"~\n\"}I’m happy because I found my strengths{\"~\n\"}Finding my strengths is one of the greatest lessons I’ve learned. Because it helped me to explore my core gift to the world: that one thing which makes me feel alive when I do it.{\"~\n\"}{\"~\n\"}Action is crucial{\"~\n\"}I don’t have to become the most excellent professor in the world, unless I want to. It is not about how high my status goes. (p.s. or I might try){\"~\n\"}{\"~\n\"}If I have neglected my writings, I can write something new today and make even greater plans.{\"~\n\"}{\"~\n\"}If I want to continue studying, I will make of list of the studies I’m interested in.{\"~\n\"}{\"~\n\"}Or I can make it even simpler: enjoying life by doing fun things such as taking a long walk to beach, hiking (even if it’s not a marathon), helping others — it all counts.{\"~\n\"}{\"~\n\"}I’ve learned to surround myself with people who are one step ahead of me in the same area of personal growth. I’ve learned about taking my life to the next level. And there is so much more in life I haven’t discovered yet.{\"~\n\"}{\"~\n\"}Creating a new life is exciting, but the action part is immensely crucial.{\"~\n\"}{\"~\n\"}Realistic thoughts{\"~\n\"}Even if I become the most super confident human in the world, there will be a moment when I will feel that I start to compare myself with others again. But, the crucial difference is, I can let go easier of the thought than I could before. It will not bother me as much anymore. I can see life at a larger scale, not wanting to control what I can’t control. Accepting that humans are different, but each and every one of us is truly special and unique.{\"~\n\"}{\"~\n\"}Again, becoming confident about myself is not about how high my status will go, it is about the peak my inner peace reaches.",
      "time": "2018/6/23",
      "id": 5
    }
  ],
  "comments": [
    {
      "post_id": "4",
      "name": "Binod Shrestha",
      "email": "binod.shrestha929@gmail.com",
      "comment": "Nice blog. Keep up the good work.",
      "id": 1
    },
    {
      "post_id": "1",
      "name": "Raj Shrestha",
      "email": "razzester86@gmail.com",
      "comment": "k ==ramro xa\n",
      "id": 2
    }
  ]
}